In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(6, 3),
index = ['a','b','c','d','e','f'], columns = ['A', 'B', 'C'])
print(df)
print (df.loc['a':'f'])

          A         B         C
a -1.638708 -1.719638 -0.424412
b  0.387460  0.321018  0.667622
c -0.193490  0.155451 -0.466222
d  0.405940 -0.355875  0.289102
e  0.160293  0.689635  2.349792
f -0.189358 -0.542947 -2.427557
          A         B         C
a -1.638708 -1.719638 -0.424412
b  0.387460  0.321018  0.667622
c -0.193490  0.155451 -0.466222
d  0.405940 -0.355875  0.289102
e  0.160293  0.689635  2.349792
f -0.189358 -0.542947 -2.427557

In [7]:
print (df.loc[:,'B'])

a   -1.719638
b    0.321018
c    0.155451
d   -0.355875
e    0.689635
f   -0.542947
Name: B, dtype: float64

In [8]:
df1=pd.DataFrame(np.random.randn(8,3),columns=['A','B','C'])
print(df1.iloc[:8])

          A         B         C
0  1.669302 -0.313939 -0.667937
1 -1.165581 -1.755630 -0.307328
2 -0.297218 -0.138645  1.361202
3 -1.736034  0.057804 -1.130736
4  0.009620 -0.039770 -0.021682
5 -0.425736  0.060675 -0.403442
6 -0.644644 -0.082349 -1.438627
7  0.431034  0.818842 -0.966497

In [9]:
# Integer slicing
print (df1.iloc[:4])
print (df1.iloc[2:4, 1:3])

          A         B         C
0  1.669302 -0.313939 -0.667937
1 -1.165581 -1.755630 -0.307328
2 -0.297218 -0.138645  1.361202
3 -1.736034  0.057804 -1.130736
          B         C
2 -0.138645  1.361202
3  0.057804 -1.130736

In [12]:
#create 2 pandas series
series1=pd.Series([1,2,3,4,5])
series2=pd.Series([6,7,8,9,10])
#addition
series3=series1 + series2
print(series3)

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [13]:
#create 2 pandas series
series1=pd.Series([1,2,3,4,5])
series2=pd.Series([6,7,8,9,10])
#sub
series3=series1 - series2
print(series3)

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [14]:
#create 2 pandas series
series1=pd.Series([1,2,3,4,5])
series2=pd.Series([6,7,8,9,10])
#multi...
series3=series1 * series2
print(series3)

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [15]:
#create 2 pandas series
series1=pd.Series([1,2,3,4,5])
series2=pd.Series([6,7,8,9,10])
#divison
series3=series1 / series2
print(series3)

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [16]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':['Umbrella', 'Matress', 'Badminton', 'Shuttle'],
                   'Last Price':[1200, 1500, 1600, 352],
                   'Updated Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 10, 10, 10]})
print(df)

        Date    Product  Last Price  Updated Price  Discount
0  10/2/2011   Umbrella        1200           1250        10
1  11/2/2011    Matress        1500           1450        10
2  12/2/2011  Badminton        1600           1550        10
3  13/2/2011    Shuttle         352            400        10

In [17]:
if 'Updated Price' in df.columns:
    df['Final cost'] = df['Updated Price'] - (df['Updated Price']*0.1)
else:
    df['Final cost'] = df['Last Price'] - (df['Last Price']*0.1)
print(df)

        Date    Product  Last Price  Updated Price  Discount  Final cost
0  10/2/2011   Umbrella        1200           1250        10      1125.0
1  11/2/2011    Matress        1500           1450        10      1305.0
2  12/2/2011  Badminton        1600           1550        10      1395.0
3  13/2/2011    Shuttle         352            400        10       360.0

In [18]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':['Umbrella', 'Matress', 'Badminton', 'Shuttle'],
                   'Last Price':[1200, 1500, 1600, 352],
                   'Discount':[10, 10, 10, 10]})
print(df)

        Date    Product  Last Price  Discount
0  10/2/2011   Umbrella        1200        10
1  11/2/2011    Matress        1500        10
2  12/2/2011  Badminton        1600        10
3  13/2/2011    Shuttle         352        10

In [19]:
if 'Updated Price' in df.columns:
    df['Final cost'] = df['Updated Price'] - (df['Updated Price']*0.1)
else:
    df['Final cost'] = df['Last Price'] - (df['Last Price']*0.1)
print(df)

        Date    Product  Last Price  Discount  Final cost
0  10/2/2011   Umbrella        1200        10      1080.0
1  11/2/2011    Matress        1500        10      1350.0
2  12/2/2011  Badminton        1600        10      1440.0
3  13/2/2011    Shuttle         352        10       316.8

In [20]:
index=pd.Index([2,2,5,3,4,np.nan])
index.value_counts()

2.0    2
5.0    1
4.0    1
3.0    1
dtype: int64

In [21]:
s = pd.Series([2, 2, 5, 3, 4, np.nan])

s.value_counts(normalize=True)

2.0    0.4
5.0    0.2
4.0    0.2
3.0    0.2
dtype: float64

In [23]:
#s = pd.Series([2, 2, 5, 3, 4, np.nan])

s.value_counts(bins=3)

(1.9960000000000002, 3.0]    3
(3.0, 4.0]                   1
(4.0, 5.0]                   1
dtype: int64

In [24]:
s.value_counts(dropna=False)

2.0    2
5.0    1
NaN    1
4.0    1
3.0    1
dtype: int64

In [25]:
#handling misssing values
df = pd.DataFrame({'column_a':[1,2,4,4,np.nan,np.nan,6],
                  'column_b':[1.2,1.4,np.nan,6.2,None,1.1,4.3],
                  'column_c':['a','?','c','d','--',np.nan,'d'],
                  'column_d':[True,True,np.nan,None,False,True,False]})
df

   column_a  column_b column_c column_d
0       1.0       1.2        a     True
1       2.0       1.4        ?     True
2       4.0       NaN        c      NaN
3       4.0       6.2        d     None
4       NaN       NaN       --    False
5       NaN       1.1      NaN     True
6       6.0       4.3        d    False

In [26]:
df.isna()

   column_a  column_b  column_c  column_d
0     False     False     False     False
1     False     False     False     False
2     False      True     False      True
3     False     False     False      True
4      True      True     False     False
5      True     False      True     False
6     False     False     False     False

In [27]:
df.isna().any()

column_a    True
column_b    True
column_c    True
column_d    True
dtype: bool

In [28]:
df.isna().sum()

column_a    2
column_b    2
column_c    1
column_d    2
dtype: int64

In [29]:
df.replace({"?":np.nan,"--":np.nan},inplace=True)
df

   column_a  column_b column_c column_d
0       1.0       1.2        a     True
1       2.0       1.4      NaN     True
2       4.0       NaN        c      NaN
3       4.0       6.2        d     None
4       NaN       NaN      NaN    False
5       NaN       1.1      NaN     True
6       6.0       4.3        d    False

In [30]:
df#drop missing values

   column_a  column_b column_c column_d
0       1.0       1.2        a     True
1       2.0       1.4      NaN     True
2       4.0       NaN        c      NaN
3       4.0       6.2        d     None
4       NaN       NaN      NaN    False
5       NaN       1.1      NaN     True
6       6.0       4.3        d    False

In [31]:
df.dropna(axis=0,how='all',inplace=True)
df

   column_a  column_b column_c column_d
0       1.0       1.2        a     True
1       2.0       1.4      NaN     True
2       4.0       NaN        c      NaN
3       4.0       6.2        d     None
4       NaN       NaN      NaN    False
5       NaN       1.1      NaN     True
6       6.0       4.3        d    False

In [32]:
df.fillna(25)

   column_a  column_b column_c column_d
0       1.0       1.2        a     True
1       2.0       1.4       25     True
2       4.0      25.0        c       25
3       4.0       6.2        d       25
4      25.0      25.0       25    False
5      25.0       1.1       25     True
6       6.0       4.3        d    False

In [33]:
df.fillna(axis=0,method='ffill')

   column_a  column_b column_c  column_d
0       1.0       1.2        a      True
1       2.0       1.4        a      True
2       4.0       1.4        c      True
3       4.0       6.2        d      True
4       4.0       6.2        d     False
5       4.0       1.1        d      True
6       6.0       4.3        d     False